# CSS position属性
### 块级元素
* 总是在新行上开始
* 高度、行高以及外边距和内边距都可控制
* 宽度缺省是它的容器的100%，除非设定一个宽度
* 可以容纳内联元素和其他块元素

### 内联元素
* 和其他元素都在一行上
* 高、行高及外边距和内边距不可改变
* 宽度就是它的文字和图片的宽度，不可改变
* 内联元素只能容纳文本或者其他内联元素

### 文档流
将窗体自上而下分为一行行，并在每行中按从左至右的顺序排放元素，即为文档流。

有三种情况使得元素脱离文档流而存在，分别是浮动、绝对定位、固定定位。
当一个元素从正常文档流中抽出后，仍然在文档流中的其他元素将忽略该元素并填补他原先的空间。


### 布局方式
* 标准流
* 浮动
* 定位

> 相对定位：相对于元素在文档流中位置进行偏移，但保留原占位。

top left：
![](pic/position_relative_lefttop.png)

right bottom：
![](pic/position_relative_rightbottom.png)
> 绝对定位：完全脱离文档流，相对于position属性非static值的最近父级元素进行偏移。

> 固定定位：完全脱离文档流，相对于视区进行偏移


### 元素的层级
```CSS
z-index:0
```
若父元素的层级大于相邻元素的层级，那么无论子元素的层级是否小于父元素相邻元素的层级，该子元素层级都将大于父元素的相邻元素的层级。
